// 默认node的执行顺序和浏览器的事件环的顺序是一致的

// -------------------------------------------


// process.nextTick(() => {
//   console.log('nextTick'); // 微任务
// });

// setTimeout(() => {
//   console.log('timeout');
// })

// console.log('hello');

// ---------------------------------------------

// 浏览器是两个队列 微任务 宏任务
// node 分n个队列

// ---------------------------------------------

// 关于setImmediate 和 setTimeout 执行顺序
// 主要看执行的上下文
// 如果在全局执行 就不一样是谁先执行
// 如果是在fs(i/o)执行 永远是setImmediate先执行

// i/o队列中的下一个永远是check阶段

// ----------------------------------------------
